
INSERT INTO manager (FIO, mail, passport_data) 
VALUES ('Попов А.А.', 'popov@mai.tu', '1815'),
 ('Зерщиков И.В.', 'asdsad@mai.tu', '324234'),
 ('Мамедов А.А.', 'xcxcxcx@mai.tu', '18324215'),
 ('Малышев О.И.', '12345@mai.tu', '1232'),
 ('Земцов А.Ы.', 'bbbb@mai.tu', '44343'),
 ('Третьякова В.Ф.', 'nbvbv@mai.tu', 'erer'),
 ('Волыже М.А.', 'mamama@mai.tu', '5464353'),
 ('Карпов С.М.', 'bvvb@mai.tu', '1815'),
 ('Авдонин М.А.', 'ffff@mai.tu', 'ghhgghhg'),
 ('Зубчеков.И.И.', 'dfdfdfd@mai.tu', '34343');

 select * from manager

 DELETE FROM manager
WHERE id_manager > 0;

DBCC CHECKIDENT ('manager', RESEED, 0)

INSERT INTO master (FIO, mail, passport_data, post, id_manager) 
VALUES ('Лубов А.А.', 'rtrtrrr@mai.tu', '444444','специалист_2_категории',1),
('Гобов В.А.', 'ЫВААЫВ@mai.tu', 'fdfd','специалист_2_категории',1),
('Суков М.Д.', '324324rrr@mai.tu', '45345','специалист_2_категории',1),
('Милов П.З.', 'вав@mai.tu', 'drfee','мастер',4),
('Даров Р.Ж.', 'fgfg@mai.tu', 'dfdf','специалист_1_категории',5),
('Привов О.Ы.', 'fgf@mai.tu', 'e4rr4','специалист_2_категории',6),
('Дасвиданов С.Ю.', '44443vvvv@mai.tu', 'recc','специалист',7),
('Мастеров П.С.', 'rtrtr555rr@mai.tu', '56555','специалист_1_категории',8),
('Васелев Р.Г.', '5555@mai.tu', 'sdfdsf','специалист_1_категории',9),
('Черпатин Л.Х.', '324343@mai.tu', 'ffff','специалист_2_категории',10);

 select * from master

 
INSERT INTO service (service_type, prise, description) 
VALUES ('ТО', '50000','техническое обслуживание'),
('СО', '15000','сервисное обслуживание'),
('Диагностика', '1000','диагностика тс'),
('Ремонт малый', '40000','ремонт'),
('Ремонт большой', '50000','ремонт с привлечение дополнительных ресурсов'),
('Гарантийное обслуживание', '10000','обслуживание по гарантии'),
('Ремонт электрики', '1000','ремонт электрики'),
('Облуживание', '14000','обслуживание'),
('Проверка', '500','Проверка'),
('Замена модулей', '50000','Замена модулей');

select * from service

INSERT INTO client(FIO, Phone_number, mail, passport_data) 
VALUES ('Попов А.А.', '546546546', 'popov@mai.tu', '324324'),
('Корпов В.А.', '46765765', '344543@mai.tu', '23434'),
('Соков Щ.А.', '34453445', 'П4554@mai.tu', '34'),
('Локов Р.А.', '45434543', 'sfsg444@mai.tu', '34324324'),
('Доко П.А.', '34534534', '443f34@mai.tu', '32d32d23'),
('Боков М.А.', '354355', 'p43r4f4opov@mai.tu', '2342efdd'),
('Бипуков Ш.А.', '65756756', '56yh66g6@mai.tu', '2e23d23d3'),
('Звоков С.А.', '35345353', '34f3f34@mai.tu', '32d32d3d3d'),
('Далков В.А.', '2342434', '34434434@mai.tu', '23d32d23d'),
('Варков Л.А.', '546645', '22222@mai.tu', '18233d15');

select * from client

INSERT INTO car(brand, model, "year" ,equipment, price, image, description, characteristics, id_client, id_master) 
VALUES ('Волво', 's1000','1999','1', 344300 ,'SFSFSDFF','машина топ комплектации','аоаоаооаоа',1, 10),
('Газ', 's1000','1999','3+', 454500 ,'SFSFSDFF','машина топ комплектации','аоаоаооаоа',2, 9),
('Лада', 'd44','2005','4', 454000,'SFSFSDFF','машина топ комплектации','аоаоаооаоа',3, 9),
('Камаз', 'g45','2022','1', 45000 ,'SFSFSDFF','машина топ комплектации','аоаоаооаоа',4, 8),
('Маз', 'sr','2020','2-', 55000 ,'SFSFSDFF','машина топ комплектации','аоаоаооаоа',5, 7),
('Мерседес', '1890','1999','super', 550000 ,'SFSFSDFF','машина топ комплектации','аоаоаооаоа',6, 6),
('Ауди', 'fre','1979','ff', 600000 ,'SFSFSDFF','машина топ комплектации','аоаоаооаоа',7, 5),
('Зил', 'fff','2001','g1', 6000000 ,'SFSFSDFF','машина топ комплектации','аоаоаооаоа',8, 4),
('Порш', '4444','2002','1', 560000 ,'SFSFSDFF','машина топ комплектации','аоаоаооаоа',9, 1),
('Феррари', 'fff','2003','1', 700000 ,'SFSFSDFF','машина топ комплектации','аоаоаооаоа',10, 1);

select * from car

INSERT INTO current_service(way_of_implementation, description, id_service, id_car) 
VALUES ('дополнительные услуги', 'дополнительные услуги замены машины', 1, 1),
('услуги +', 'услуги замены двигателя', 2, 2),
('замна капота', 'очень сложная замена капота', 3, 2),
('замена задней двери', 'замена задней двери', 4, 2),
('замена колес', 'замена 4х колес', 5, 3),
('замена водителя', 'замена раба на работу у владельца', 6, 6),
('замена электроники', 'замена электроники', 7, 4),
('замена машины', 'замена машины', 8, 9),
('диагностика', 'диагностика передней части', 9, 10),
('замена руля', 'замена рулевого отделения', 10, 6);

select * from current_service

INSERT INTO current_servise_master(id_current_servise, id_master, description) 
VALUES (1, 1, 'сторонняя помощь'),
(2, 2, 'сторонняя помощь'),
(2, 3, 'сторонняя помощь'),
(4, 4, 'сторонняя помощь'),
(5, 4, 'сторонняя помощь'),
(6, 5, 'сторонняя помощь'),
(7, 5, 'сторонняя помощь'),
(8, 5, 'сторонняя помощь'),
(9, 6, 'сторонняя помощь'),
(10, 7, 'сторонняя помощь');


select * from current_servise_master










